cf_billing/Documents/бестПочасоваяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПочасоваяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестДанныеПочасовойВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестЗагруженныеДанныеИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестПочасоваяВедомость/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	ЗаполнитьДинамическуюТЧ();
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПочасоваяВедомость(ЭтотОбъект);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	ОтборПоОбъектуРасчета();
	ОтборПоТочкеУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьТЧ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактаПриИзменении(Элемент)
	ЗаполнитьДинамическуюТЧ(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОтборПоОбъектуРасчета();
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры 

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	ОтборПоТочкеУчета();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьДинамическуюТЧ(ОчиститьТЧ = Ложь)
	Если ОчиститьТЧ Тогда
		Объект.ПредоставленныеОбъемы.Очистить();
	КонецЕсли;
	Если Объект.ПредоставленныеОбъемы.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
			пДата = Объект.ДатаФактическогоСобытия;
		Иначе
			пДата = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДатаСеанса());
		КонецЕсли;
		ДобавляемыйДень = НачалоМесяца(пДата);
		Пока Месяц(ДобавляемыйДень) = Месяц(пДата) Цикл
			НовСтр 		= ТЗПредоставленныеОбъемы.Добавить();
			НовСтр.День 	= ДобавляемыйДень;
			ТекущийЧас = 0;
			Пока ТекущийЧас < 24 Цикл
				НовСтр["Час" + ТекущийЧас] = -1;
				ТекущийЧас = ТекущийЧас + 1;
			КонецЦикла;
			ДобавляемыйДень = ДобавляемыйДень + 86400;
		КонецЦикла;
	Иначе
		Для каждого стр из Объект.ПредоставленныеОбъемы Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("День", стр.День);
			НайденныеСтроки = ТЗПредоставленныеОбъемы.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполняемаяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			Иначе
				ЗаполняемаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			ЗаполняемаяСтрока["Час" + стр.Час] 	= стр.Объем;
			ЗаполняемаяСтрока.День 				= стр.День;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТЧ()
	Объект.ПредоставленныеОбъемы.Очистить();
	Для каждого стр Из ТЗПредоставленныеОбъемы Цикл
		ТекущийЧас = 0;
		Пока ТекущийЧас <= 23 Цикл
			НовСтр = Объект.ПредоставленныеОбъемы.Добавить();
			НовСтр.День = стр.День;
			НовСтр.Объем = стр["Час" + ТекущийЧас];
			НовСтр.Час = ТекущийЧас;
			ТекущийЧас = ТекущийЧас + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора(МассивДляВыбора, ИмяРеквизита)
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДляВыбора));
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(НовыйПараметр);
	Элементы[ИмяРеквизита].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
КонецПроцедуры 

&НаСервере
Процедура ОтборПоОбъектуРасчета() 
	Результат = бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета);
	УстановитьПараметрыВыбора(Результат.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"), "ТочкаУчета");
КонецПроцедуры  

&НаСервере
Процедура ОтборПоТочкеУчета() 
	МассивДляВыбора = бестРаботаСприборамиУчетаСервер.ПолучитьМассивДействующихПриборовУчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Объект.ТочкаУчета);
	УстановитьПараметрыВыбора(МассивДляВыбора, "ПриборУчета");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти
